### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
data.external.modal_source_hash: Reading...
null_resource.control_plane_build: Refreshing state... [id=4666792582705774312]
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=5534312244345060584]
null_resource.slack_bot_build: Refreshing state... [id=5361720346763265582]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=2408714134199310392]
module.slack_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=9f6313d6aaec43c2b677e11e61d894fc]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=20cd831008084e66a21a63410cd5f350]
cloudflare_d1_database.main: Refreshing state... [id=5929035a-37d3-40a9-9ba8-6bb20a8f7996]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=4353800105675241246]
module.web_app.vercel_project.this: Refreshing state... [id=prj_rRe2jDS9t2jjyy1xiuWrbw7kXQs6]
null_resource.d1_migrations: Refreshing state... [id=5851108403405785436]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=81781fcfa9b14caca520d9dc7aa706d9]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=ac423163-a01a-4ecb-8503-1b3bdc62580d]
module.web_app.vercel_project_environment_variable.env[1]: Refreshing state... [id=7OkUtGu9PrtXFOPu]
module.web_app.vercel_project_environment_variable.env[7]: Refreshing state... [id=CzYSQUpvdSFybv7v]
module.web_app.vercel_project_environment_variable.env[5]: Refreshing state... [id=ObBeQGGf88WSVfUC]
module.web_app.vercel_project_environment_variable.env[4]: Refreshing state... [id=TwfVJmoNgOul5Ak8]
module.web_app.vercel_project_environment_variable.env[0]: Refreshing state... [id=jC2kYsiWrCuuATL9]
module.web_app.vercel_project_environment_variable.env[2]: Refreshing state... [id=kOMITM4LuiBVESGt]
module.web_app.vercel_project_environment_variable.env[3]: Refreshing state... [id=amTaiWNUs9FfMNqQ]
module.web_app.vercel_project_environment_variable.env[8]: Refreshing state... [id=5YZKecdzdxYIHDtI]
module.web_app.vercel_project_environment_variable.env[6]: Refreshing state... [id=CKKq4LYiXGBtkuen]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=3d244e00-52c6-46c4-9093-200be69a3f59]
module.slack_bot_worker.cloudflare_worker.this: Refreshing state... [id=2acbaa32b47b4cd5b59ca05022e949e2]
module.slack_bot_worker.cloudflare_worker_version.this: Refreshing state... [id=d2712188-980e-458c-8c67-c049591715a8]
module.slack_bot_worker.cloudflare_workers_deployment.this: Refreshing state... [id=cce3799d-e6d3-42ea-9244-5ed99f467bce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "4666792582705774312" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-12T22:14:37Z" -> (known after apply)
        }
    }

  # null_resource.slack_bot_build must be replaced
-/+ resource "null_resource" "slack_bot_build" {
      ~ id       = "5361720346763265582" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-12T22:14:37Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-12T22:14:42Z" -> (known after apply)
      ~ id                  = "ac423163-a01a-4ecb-8503-1b3bdc62580d" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/control-plane/dist/index.js" -> null
              - content_sha256 = "8a2272aa90bb7ca47fd9711304e94a1b968f320bd8e4d3b0d7d29d6604c3639c" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/control-plane/dist/index.js"
              + content_sha256 = "b9ec990617fd22179847156d355f29fa8e716ca7fbd1c8b097251d98a06359d9"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 22 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      + author_email = (known after apply)
      ~ created_on   = "2026-02-12T22:14:44Z" -> (known after apply)
      ~ id           = "3d244e00-52c6-46c4-9093-200be69a3f59" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "ac423163-a01a-4ecb-8503-1b3bdc62580d" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.modal_app.null_resource.modal_deploy must be replaced
-/+ resource "null_resource" "modal_deploy" {
      ~ id       = "4353800105675241246" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "secrets_created" = "2408714134199310392" -> (known after apply)
          ~ "source_hash"     = "be772507e66cfb0220ba8c4571e155684bd3dd898cdbb001585af74993fa43f7" -> "b8bd4318ecd8c3bfdda72b4eecb6eccbe530ebde5fe751ca559158d3535b65ec"
            # (2 unchanged elements hidden)
        }
    }

  # module.modal_app.null_resource.modal_secrets[0] must be replaced
-/+ resource "null_resource" "modal_secrets" {
      ~ id       = "2408714134199310392" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "secrets_hash" = (sensitive value)
        }
    }

  # module.slack_bot_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-12T22:14:44Z" -> (known after apply)
      ~ id                  = "d2712188-980e-458c-8c67-c049591715a8" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/slack-bot/dist/index.js" -> null
              - content_sha256 = "fb92decc5db25a2b253ec083df7c51b8810cf8d9d4eaae99743c43a9f5024004" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/slack-bot/dist/index.js"
              + content_sha256 = "3c60ceaf6332b87a925b5a9d9585495465c6640fb2a205646b0803c38adbfd1d"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 22 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.slack_bot_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      + author_email = (known after apply)
      ~ created_on   = "2026-02-12T22:14:45Z" -> (known after apply)
      ~ id           = "cce3799d-e6d3-42ea-9244-5ed99f467bce" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "d2712188-980e-458c-8c67-c049591715a8" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @DylanZeller*